In [3]:
import csv

with open(file='try.csv', mode='r') as f:
    reader = csv.reader(f)
    for row in reader:
        print(row)

['Name', 'Address', 'Age']
['Ram', 'Itahari', '23']
['Shyam', 'Dharan', '22']
['Hari', 'Biratnagar', '21']

In [ ]:
import csv

with open(file='try.csv', mode='r') as f:
    reader = csv.DictReader(f)
    for row in reader:
        print(row["Name"], ' ', row["Address"])

{'Name': 'Ram', 'Address': 'Itahari', 'Age': '23'}
{'Name': 'Shyam', 'Address': 'Dharan', 'Age': '22'}
{'Name': 'Hari', 'Address': 'Biratnagar', 'Age': '21'}

In [9]:
import csv

data = [
    ['Name', 'Address', 'Age'],
    ['Ram', 'Itahari', '23'],
    ['Shyam', 'Dharan', '22'],
    ['Hari', 'Biratnagar', '21']
]

with open(file="newnew.csv", mode='w', newline="") as f:
    writer = csv.writer(f)
    writer.writerows(data)

In [11]:
import csv

data = [
    {'Name': 'Ram', 'Address': 'Itahari', 'Age': '23'},
    {'Name': 'Shyam', 'Address': 'Dharan', 'Age': '22'},
    {'Name': 'Hari', 'Address': 'Biratnagar', 'Age': '21'}
]

with open(file='newnewnew.csv', mode='w', newline="") as f:
    writer = csv.DictWriter(f, fieldnames=["Name", "Address", "Age"])
    writer.writeheader()
    writer.writerows(data)

In [12]:
import pandas as pd


df = pd.read_csv("newnewnew.csv")
print(df)
print(type(df))

    Name     Address  Age
0    Ram     Itahari   23
1  Shyam      Dharan   22
2   Hari  Biratnagar   21
<class 'pandas.core.frame.DataFrame'>

In [13]:
df["Name"]

0      Ram
1    Shyam
2     Hari
Name: Name, dtype: object

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Address  3 non-null      object
 2   Age      3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [18]:
df.head(1)

  Name  Address  Age
0  Ram  Itahari   23

In [17]:
df.tail(2)

    Name     Address  Age
1  Shyam      Dharan   22
2   Hari  Biratnagar   21

In [ ]:
df.sample()  #random value or sample form the csv file

    Name Address  Age
1  Shyam  Dharan   22

In [23]:
df.isnull().sum()

Name       0
Address    0
Age        0
dtype: int64

In [24]:
df["Province"] = "Koshi"

In [25]:
df

    Name     Address  Age Province
0    Ram     Itahari   23    Koshi
1  Shyam      Dharan   22    Koshi
2   Hari  Biratnagar   21    Koshi

In [26]:
import pandas as pd

dataframe = pd.DataFrame([
    {"Roll":1,"Name":"Ram", "Eng":80, "Math":81, "Science":82},
    {"Roll":2,"Name":"Shya", "Eng":79, "Math":80, "Science":83}
])

In [27]:
dataframe

   Roll  Name  Eng  Math  Science
0     1   Ram   80    81       82
1     2  Shya   79    80       83

In [29]:
dataframe["Total"] = dataframe["Eng"] + dataframe["Math"] + dataframe["Science"]
dataframe["Percentage"] = (dataframe["Total"] / 3).round(decimals=3)
dataframe

   Roll  Name  Eng  Math  Science  Total  Percentage
0     1   Ram   80    81       82    243      81.000
1     2  Shya   79    80       83    242      80.667